import os
import requests
from urllib.parse import unquote
from bs4 import BeautifulSoup
import pandas as pd
import zipfile
import re


class Tourism:
    def __init__(self, data_dir="data", checkpoint_path="checkpoint.txt"):
        self.csv_dir = data_dir
        self.xlsx_dir = os.path.join(data_dir, "xlsx")
        self.converted_dir = os.path.join(data_dir, "xlsx", "converted")

        os.makedirs(self.csv_dir, exist_ok=True)
        os.makedirs(self.xlsx_dir, exist_ok=True)
        os.makedirs(self.converted_dir, exist_ok=True)

        self.base_url = "https://admin.taiwan.net.tw"
        self.url = "https://admin.taiwan.net.tw/businessinfo/FilePage?a=12603"

        self.checkpoint_path = checkpoint_path
        self.checkpoint = self.get_checkpoint()

        self.columns = [
            "類型",
            "觀光風景區",
            "觀光遊憩區",
            "縣市",
            "年月",
            "遊客人次",
            "去年同月遊客人次",
            "差值",
            "成長率",
            "遊客人次計算方式",
            "遊客人次計算類型",
            "資料來源",
        ]

        self.map = self.get_map()

    def get_checkpoint(self):

        # 檢查checkpoint檔案是否存在
        if not os.path.exists(self.checkpoint_path):

            # 如果檔案不存在，創建並寫入初始內容
            with open(self.checkpoint_path, "w", encoding="utf-8") as f:
                f.write("113-12-05")

            print(f"Checkpoint file created with default content: 113-12-05")

        with open(self.checkpoint_path, "r", encoding="utf-8") as f:
            return f.read()

    def update_checkpoint(self, checkpoint):
        self.checkpoint = checkpoint

        with open(self.checkpoint_path, "w", encoding="utf-8") as f:
            f.write(checkpoint)

    def get_xlsx_link_dict(self):

        # 取得html
        response = requests.get(self.url)
        html = response.text

        # 取得table內容
        soup = BeautifulSoup(html, "html.parser")
        body = soup.body
        tbody = body.find("tbody")

        link_dict = {}

        # 逐行尋找
        for tr in tbody.find_all("tr"):
            tds = tr.find_all("td")

            # 找checkpoint以後更新的資料
            update_date = tds[-1].text

            if update_date < self.checkpoint:
                continue

            # 取得資料名稱
            name = f"{tds[1].text}_{update_date.replace('-', '')}.xlsx"

            # 取得xlsx檔連結
            a = tds[2].find("a", title=lambda t: t and "檔案格式：XLS" in t)
            link_dict[name] = self.base_url + a.get("href")

        return link_dict

    def download_xlsx(self, xlsx_link_dict):
        for xlsx_name, xlsx_link in xlsx_link_dict.items():
            print(f"URL: {xlsx_link}")
            response = requests.get(xlsx_link)

            if response.status_code == 200:

                # # 提取 Content-Disposition 標頭中的檔名
                # content_disposition = response.headers.get("Content-Disposition")
                # filename = content_disposition.split("filename=")[-1]

                # # 解碼檔案名稱
                # xlsx_name = unquote(filename)

                # 建立檔案路徑
                xlsx_path = os.path.join(self.xlsx_dir, xlsx_name)

                # 存檔
                with open(xlsx_path, "wb") as f:
                    f.write(response.content)
                    print(f"Saved {xlsx_path}.")

            else:
                raise Exception(
                    f"Failed to download file. Status code: {response.status_code}"
                )

    def xlsx_to_csv(self):
        xlsx_files = [
            file for file in os.listdir(self.xlsx_dir) if file.endswith(".xlsx")
        ]

        for xlsx_file in xlsx_files:
            xlsx_path = os.path.join(self.xlsx_dir, xlsx_file)

            # xlsx轉df
            print(f"\nConverting: {xlsx_path}...")

            # 跳過標頭
            if (
                "2016" in xlsx_file
                or "2017" in xlsx_file
                or (
                    "2018" in xlsx_file
                    and "11月" not in xlsx_file
                    and "12月" not in xlsx_file
                )
                or "2020" in xlsx_file
            ):
                df = pd.read_excel(xlsx_path, skiprows=1)

            else:
                df = pd.read_excel(xlsx_path, skiprows=2)

            # 處理df
            year_month_split = xlsx_file.split("月")[0].split("年")
            year = int(year_month_split[0])
            month = int(year_month_split[1])
            year_month = f"{year}-{month:02}"
            df = self.process_df(df, year_month)

            # 存檔
            csv_name = xlsx_file.replace(".xlsx", ".csv")
            csv_path = os.path.join(self.csv_dir, csv_name)
            df.to_csv(csv_path, index=False)
            print(f"Saved: {csv_path}.")

            # 將xlsx壓縮後移到converted資料夾
            zip_path = os.path.join(
                self.converted_dir, xlsx_file.replace(".xlsx", ".zip")
            )

            with zipfile.ZipFile(zip_path, "w", zipfile.ZIP_DEFLATED) as zipf:
                zipf.write(csv_path, arcname=csv_name)

            print(f"Compressed: {xlsx_path} to {zip_path}.")

    def process_df(self, df, year_month):
        print("\n原欄位:", df.columns.tolist())

        # 刪除欄位名稱的換行符號和空格
        df.columns = [col.split("\n")[0].replace(" ", "") for col in df.columns]

        # 重新命名部份欄位名稱
        df = df.rename(
            columns={
                "類型Type": "類型",
                "類型Class": "類型",
                "觀光遊憩區ScenicSpots": "觀光遊憩區",
                "縣市City/Country": "縣市",
                "縣市別": "縣市",
                "縣市別City/County": "縣市",
                "縣市別Location": "縣市",
                "今年人數": "遊客人次",
                f"{int(year_month.split('-')[0])-1911}年{int(year_month.split('-')[1])}月": "遊客人次",
                "上年同月": "去年同月遊客人次",
                "上年同月遊客人次": "去年同月遊客人次",
                "備註": "遊客人次計算方式",
                "備註Endorse": "遊客人次計算方式",
            }
        )

        print("\n修改欄位名稱後:", df.columns.tolist())

        print("\n原資料:", df.head(2), "\n")

        # 刪除英文
        cols = ["類型", "觀光遊憩區", "縣市"]
        df[cols] = df[cols].map(
            lambda x: re.sub(r"[a-zA-Z\s]", "", x) if isinstance(x, str) else x
        )

        # 刪除觀光遊憩區中的分類和最下方的備註
        del_idx = []

        for idx, row in df.iterrows():
            if pd.isna(row["縣市"]):
                del_idx.append(idx)
                print("刪除列", row.values.tolist())

        df = df.drop(del_idx, axis=0).reset_index(drop=True)

        # 新增「觀光風景區」欄位
        df["觀光風景區"] = df["觀光遊憩區"].map(
            lambda x: self.map[x][1] if x in self.map else print(x)
        )

        # 填入「類型」欄位
        df["類型"] = df["觀光遊憩區"].map(lambda x: self.map(x)[0])

        # 刪除縮排
        df = df.map(lambda x: x.replace("  ", "") if isinstance(x, str) else x)

        # 處理nan
        df = df.replace("nan", "")

        # 刪除tab
        df = df.replace("\t", "", regex=True)

        # 新增遊客人次計算類型欄位
        # df.to_csv("tmp.csv", index=False)
        df["遊客人次計算類型"] = df["遊客人次計算方式"].map(
            lambda x: self.get_count_type(x) if isinstance(x, str) else x
        )

        # 替換成長率的"-"為空值
        df["成長率"] = df["成長率"].replace("-", "")

        # 新增年月欄位
        df["年月"] = year_month

        # 排序欄位
        df = df.reindex(columns=self.columns)

        print("\n處理後:", df.head(2))

        return df

    def get_count_type(self, count_method):

        keywords = {
            "門票": "門票數",  # 電子計數器及門票數計算
            "人工": "人工估算",  # 人工計數器
            "計數器": "電子感應",  # 紅外線計數器自動偵測
            "電子計數": "電子感應",  # 紅外線計數器自動偵測
            "感應器": "電子感應",
            "估算": "人工估算",
            "系統自動偵測": "AI辨識",
            "登記": "登記數量",
            "核准進入": "人工估算",
            "監測系統": "AI辨識",
            "AI": "AI辨識",
            "電信": "電信數據",
            "推估": "人工估算",
            "人力統計": "人工估算",
            "行動裝置": "電信數據",
            "推算": "人工估算",
            "入境人數計算": "人工估算",
            "概估": "人工估算",
            "數計算": "人工估算",
            "數位人流計數": "電子感應",
            "人流": "人工估算",
            "停車數": "人工估算",
            "人數": "人工估算",
            "自動": "AI辨識",
            "電子": "電子感應",
            "住宿人次": "人工估算",
            "人數": "人工估算",
            "參照觀光大平臺之數據": "人工估算",
            "觀光大數據": "人工估算",
        }

        for key in keywords.keys():
            if key in count_method:
                return keywords[key]

        return None
        # raise Exception(f"需定義遊客人次計算類型: {count_method}")

    def get_history_link_dict(self):
        link_dict = {}

        for page in range(2, 13):
            url = f"{self.url}&P={page}"

            # 取得html
            response = requests.get(url)
            html = response.text

            # 取得table內容
            soup = BeautifulSoup(html, "html.parser")
            body = soup.body
            tbody = body.find("tbody")

            # 逐行尋找
            for tr in tbody.find_all("tr"):
                tds = tr.find_all("td")

                update_date = tds[-1].text

                # 取得xlsx檔連結
                a = tds[2].find("a", title=lambda t: t and "檔案格式：XLS" in t)

                name = f"{tds[1].text}_{update_date.replace('-', '')}.xlsx"

                if "~" in name or "至" in name:
                    continue

                if not a:
                    a = tds[2].find("a", title=lambda t: t and "檔案格式：ODS" in t)
                    name = f"{tds[1].text}_{update_date.replace('-', '')}.ods"

                if not a:
                    a = tds[2].find("a", title=lambda t: t and "檔案格式：PDF" in t)
                    name = f"{tds[1].text}_{update_date.replace('-', '')}.pdf"

                name = name.replace(" ", "")

                link = self.base_url + a.get("href")

                link_dict[name] = link

        return link_dict

    def history_data_to_csv(self, history_link_dict):
        for name, link in history_link_dict.items():
            if "xlsx" in name:
                tourism.xlsx_to_csv({name: link})

            elif "ods" in name:
                pass

            elif "pdf" in name:
                pass

    def get_map(self):
        return {
            "觀光遊憩區": ["類型", "觀光風景區"],
            "陽明山遊客中心": ["國家公園", "陽明山國家公園"],
            "陽明書屋": ["國家公園", "陽明山國家公園"],
            "陽明公園": ["國家公園", "陽明山國家公園"],
            "大屯遊憩區": ["國家公園", "陽明山國家公園"],
            "龍鳳谷遊憩區": ["國家公園", "陽明山國家公園"],
            "小油坑遊憩區": ["國家公園", "陽明山國家公園"],
            "冷水坑": ["國家公園", "陽明山國家公園"],
            "擎天崗": ["國家公園", "陽明山國家公園"],
            "塔塔加遊憩區": ["國家公園", "玉山國家公園"],
            "梅山遊客中心": ["國家公園", "玉山國家公園"],
            "南安遊客中心": ["國家公園", "玉山國家公園"],
            "玉山管理處遊客服務中心": ["國家公園", "玉山國家公園"],
            "排雲山莊": ["國家公園", "玉山國家公園"],
            "汶水遊客中心": ["國家公園", "雪霸國家公園"],
            "觀霧遊客中心": ["國家公園", "雪霸國家公園"],
            "雪見遊憩區": ["國家公園", "雪霸國家公園"],
            "墾丁國家公園管理處遊客中心": ["國家公園", "墾丁國家公園"],
            "鵝鑾鼻公園": ["國家公園", "墾丁國家公園"],
            "貓鼻頭公園": ["國家公園", "墾丁國家公園"],
            "佳樂水": ["國家公園", "墾丁國家公園"],
            "社頂自然公園": ["國家公園", "墾丁國家公園"],
            "南灣遊憩區": ["國家公園", "墾丁國家公園"],
            "龍鑾潭自然中心": ["國家公園", "墾丁國家公園"],
            "砂島貝殼砂展示館": ["國家公園", "墾丁國家公園"],
            "太魯閣國家公園遊客中心": ["國家公園", "太魯閣國家公園"],
            "布洛灣遊憩區": ["國家公園", "太魯閣國家公園"],
            "臺八線沿線景觀區": ["國家公園", "太魯閣國家公園"],
            "中山林遊客中心": ["國家公園", "金門國家公園"],
            "翟山坑道": ["國家公園", "金門國家公園"],
            "雙鯉溼地自然中心": ["國家公園", "金門國家公園"],
            "古寧頭戰史館": ["國家公園", "金門國家公園"],
            "九宮(四維)坑道": ["國家公園", "金門國家公園"],
            "八二三砲戰紀念館": ["國家公園", "金門國家公園"],
            "湖井頭戰史館": ["國家公園", "金門國家公園"],
            "金水學校": ["國家公園", "金門國家公園"],
            "蔣經國先生紀念館": ["國家公園", "金門國家公園"],
            "民俗文化村": ["國家公園", "金門國家公園"],
            "得月樓": ["國家公園", "金門國家公園"],
            "壽山園區": ["國家公園", ""],
            "半屏山園區": ["國家公園", ""],
            "龜山園區": ["國家公園", ""],
            "旗後山園區": ["國家公園", ""],
            "鼻頭龍洞遊憩區": ["國家級風景特定區", "東北角及宜蘭海岸國家風景區"],
            "鹽寮福隆遊憩區": ["國家級風景特定區", "東北角及宜蘭海岸國家風景區"],
            "大里外澳遊憩區": ["國家級風景特定區", "東北角及宜蘭海岸國家風景區"],
            "宜蘭濱海遊憩區": ["國家級風景特定區", "東北角及宜蘭海岸國家風景區"],
            "野柳地質公園": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "白沙灣": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "翡翠灣濱海遊憩區": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "觀音山": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "情人湖及湖海灣": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "野柳海洋世界": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "金山遊憩區": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "三芝遊憩區": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "和平島公園": ["國家級風景特定區", "北海岸及觀音山國家風景區"],
            "東部海岸富岡地質公園及加路蘭休憩區": [
                "國家級風景特定區",
                "東部海岸國家風景區",
            ],
            "三仙台遊憩區及周邊地區": ["國家級風景特定區", "東部海岸國家風景區"],
            "八仙洞遊憩區": ["國家級風景特定區", "東部海岸國家風景區"],
            "秀姑巒溪遊客中心園區": ["國家級風景特定區", "東部海岸國家風景區"],
            "綠島遊憩區": ["國家級風景特定區", "東部海岸國家風景區"],
            "都歷處本部": ["國家級風景特定區", "東部海岸國家風景區"],
            "石梯坪遊憩區": ["國家級風景特定區", "東部海岸國家風景區"],
            "花蓮遊客中心園區": ["國家級風景特定區", "東部海岸國家風景區"],
            "都蘭遊憩區及周邊地區": ["國家級風景特定區", "東部海岸國家風景區"],
            "鯉魚潭風景區": ["國家級風景特定區", "花東縱谷國家風景區"],
            "鹿野高臺及周邊地區": ["國家級風景特定區", "花東縱谷國家風景區"],
            "花蓮糖廠及周邊地區": ["國家級風景特定區", "花東縱谷國家風景區"],
            "赤科山": ["國家級風景特定區", "花東縱谷國家風景區"],
            "六十石山": ["國家級風景特定區", "花東縱谷國家風景區"],
            "舞鶴台地": ["國家級風景特定區", "花東縱谷國家風景區"],
            "大農大富平地森林園區": ["國家級風景特定區", "花東縱谷國家風景區"],
            "卑南初鹿地區": ["國家級風景特定區", "花東縱谷國家風景區"],
            "獅頭山風景區(新竹地區)": ["國家級風景特定區", "參山國家風景區"],
            "獅頭山風景區(苗栗地區)": ["國家級風景特定區", "參山國家風景區"],
            "梨山風景區(谷關地區)": ["國家級風景特定區", "參山國家風景區"],
            "梨山風景區(梨山地區)": ["國家級風景特定區", "參山國家風景區"],
            "八卦山風景區(彰化地區)": ["國家級風景特定區", "參山國家風景區"],
            "八卦山風景區(南投地區)": ["國家級風景特定區", "參山國家風景區"],
            "七股鹽業遊憩區": ["國家級風景特定區", "雲嘉南濱海國家風景區"],
            "北門鹽業遊憩區": ["國家級風景特定區", "雲嘉南濱海國家風景區"],
            "馬沙溝濱海遊憩區": ["國家級風景特定區", "雲嘉南濱海國家風景區"],
            "布袋遊憩區": ["國家級風景特定區", "雲嘉南濱海國家風景區"],
            "圓潭自然生態園區": ["國家級風景特定區", "阿里山國家風景區"],
            "達娜伊谷": ["國家級風景特定區", "阿里山國家風景區"],
            "觸口遊客中心": ["國家級風景特定區", "阿里山國家風景區"],
            "梅山太平雲梯": ["國家級風景特定區", "阿里山國家風景區"],
            "日月潭環潭區": ["國家級風景特定區", "日月潭國家風景區"],
            "車埕": ["國家級風景特定區", "日月潭國家風景區"],
            "柳營尖山埤渡假村": ["國家級風景特定區", "西拉雅國家風景區"],
            "曾文水庫": ["國家級風景特定區", "西拉雅國家風景區"],
            "烏山頭水庫風景區": ["國家級風景特定區", "西拉雅國家風景區"],
            "關子嶺溫泉區": ["國家級風景特定區", "西拉雅國家風景區"],
            "虎頭埤風景區": ["國家級風景特定區", "西拉雅國家風景區"],
            "中埔遊客中心": ["國家級風景特定區", "西拉雅國家風景區"],
            "茂林遊憩區": ["國家級風景特定區", "茂林國家風景區"],
            "寶來、不老溫泉區": ["國家級風景特定區", "茂林國家風景區"],
            "臺灣原住民文化園區": ["國家級風景特定區", "茂林國家風景區"],
            "霧臺遊憩區": ["國家級風景特定區", "茂林國家風景區"],
            "涼山遊憩區": ["國家級風景特定區", "茂林國家風景區"],
            "禮納里部落": ["國家級風景特定區", "茂林國家風景區"],
            "三地門遊憩區": ["國家級風景特定區", "茂林國家風景區"],
            "小琉球遊憩區": ["國家級風景特定區", "大鵬灣國家風景區"],
            "大鵬灣遊憩區": ["國家級風景特定區", "大鵬灣國家風景區"],
            "澎湖遊客中心": ["國家級風景特定區", "澎湖國家風景區"],
            "南海遊客中心": ["國家級風景特定區", "澎湖國家風景區"],
            "北海遊客中心": ["國家級風景特定區", "澎湖國家風景區"],
            "西嶼西臺": ["國家級風景特定區", "澎湖國家風景區"],
            "小門遊憩區": ["國家級風景特定區", "澎湖國家風景區"],
            "綠蠵龜觀光保育中心": ["國家級風景特定區", "澎湖國家風景區"],
            "七美遊憩區": ["國家級風景特定區", "澎湖國家風景區"],
            "北寮奎壁山地質公園": ["國家級風景特定區", "澎湖國家風景區"],
            "望安遊憩區": ["國家級風景特定區", "澎湖國家風景區"],
            "東引遊客中心": ["國家級風景特定區", "馬祖國家風景區"],
            "莒光遊客中心": ["國家級風景特定區", "馬祖國家風景區"],
            "北竿遊客中心": ["國家級風景特定區", "馬祖國家風景區"],
            "南竿遊客中心": ["國家級風景特定區", "馬祖國家風景區"],
            "烏來風景特定區": ["直轄市及縣(市)級風景特定區", ""],
            "碧潭風景特定區": ["直轄市及縣(市)級風景特定區", ""],
            "武荖坑風景區": ["直轄市及縣(市)級風景特定區", ""],
            "石門水庫風景區": ["直轄市及縣(市)級風景特定區", ""],
            "角板山遊憩區": ["直轄市及縣(市)級風景特定區", ""],
            "虎頭山風景特定區": ["直轄市及縣(市)級風景特定區", ""],
            "冬山河親水公園": ["直轄市及縣(市)級風景特定區", ""],
            "五峰旗風景區": ["直轄市及縣(市)級風景特定區", ""],
            "龍潭湖": ["直轄市及縣(市)級風景特定區", ""],
            "冬山河生態綠舟": ["直轄市及縣(市)級風景特定區", ""],
            "七星潭風景區": ["直轄市及縣(市)級風景特定區", ""],
            "小烏來風景特定區": ["直轄市及縣(市)級風景特定區", ""],
            "鐵砧山": ["直轄市及縣(市)級風景特定區", ""],
            "東埔溫泉": ["直轄市及縣(市)級風景特定區", ""],
            "蘭潭": ["直轄市及縣(市)級風景特定區", ""],
            "瑞芳風景特定區": ["直轄市及縣(市)級風景特定區", ""],
            "台東森林公園": ["直轄市及縣(市)級風景特定區", ""],
            "拉拉山風景區": ["直轄市及縣(市)級風景特定區", ""],
            "池南國家森林遊樂區": ["森林遊樂區", ""],
            "富源國家森林遊樂區": ["森林遊樂區", ""],
            "阿里山國家森林遊樂區": ["森林遊樂區", ""],
            "墾丁國家森林遊樂區": ["森林遊樂區", ""],
            "滿月圓國家森林遊樂區": ["森林遊樂區", ""],
            "內洞國家森林遊樂區": ["森林遊樂區", ""],
            "太平山國家森林遊樂區": ["森林遊樂區", ""],
            "棲蘭森林遊樂區": ["森林遊樂區", ""],
            "明池森林遊樂區": ["森林遊樂區", ""],
            "東眼山國家森林遊樂區": ["森林遊樂區", ""],
            "八仙山國家森林遊樂區": ["森林遊樂區", ""],
            "大雪山國家森林遊樂區": ["森林遊樂區", ""],
            "奧萬大國家森林遊樂區": ["森林遊樂區", ""],
            "惠蓀林場": ["森林遊樂區", ""],
            "溪頭自然教育園區": ["森林遊樂區", ""],
            "合歡山國家森林遊樂區": ["森林遊樂區", ""],
            "雙流國家森林遊樂區": ["森林遊樂區", ""],
            "知本國家森林遊樂區": ["森林遊樂區", ""],
            "萬瑞森林樂園": ["森林遊樂區", ""],
            "觀音蓮花園休閒農業區": ["休閒農業區及休閒農場", ""],
            "綠世界休閒農場": ["休閒農業區及休閒農場", ""],
            "南園人文客棧": ["休閒農業區及休閒農場", ""],
            "飛牛牧場": ["休閒農業區及休閒農場", ""],
            "走馬瀨農場": ["休閒農業區及休閒農場", ""],
            "大溪月眉休閒農業區": ["休閒農業區及休閒農場", ""],
            "清水地熱公園": ["觀光地區", ""],
            "麗寶樂園渡假村": ["觀光地區", ""],
            "東勢林場遊樂區": ["觀光地區", ""],
            "赤嵌樓": ["觀光地區", ""],
            "臺南孔子廟": ["觀光地區", ""],
            "祀典武廟": ["觀光地區", ""],
            "大天后宮": ["觀光地區", ""],
            "安平小鎮": ["觀光地區", ""],
            "舊山線鐵道自行車": ["觀光地區", ""],
            "豐濱鄉親不知子海上古道及周邊地區": ["觀光地區", ""],
            "三義水美木雕街": ["觀光地區", ""],
            "龍鳳漁港": ["觀光地區", ""],
            "尚順育樂世界": ["觀光地區", ""],
            "屏菸1936文化基地": ["觀光地區", ""],
            "國立海洋生物博物館": ["博物館", ""],
            "臺灣客家文化館": ["博物館", ""],
            "六堆客家文化園區": ["博物館", ""],
            "國立故宮博物院": ["博物館", ""],
            "臺北市立美術館": ["博物館", ""],
            "國立歷史博物館": ["博物館", ""],
            "國立臺灣科學教育館": ["博物館", ""],
            "臺北市立天文科學教育館": ["博物館", ""],
            "國立國父紀念館": ["博物館", ""],
            "國立中正紀念堂": ["博物館", ""],
            "台北探索館": ["博物館", ""],
            "新北市坪林茶業博物館": ["博物館", ""],
            "新北市立鶯歌陶瓷博物館": ["博物館", ""],
            "新北市立十三行博物館": ["博物館", ""],
            "新北市立黃金博物館": ["博物館", ""],
            "新北市客家文化園區": ["博物館", ""],
            "國立海洋科技博物館": ["博物館", ""],
            "陽明海洋文化藝術館": ["博物館", ""],
            "木雕博物館": ["博物館", ""],
            "國立自然科學博物館": ["博物館", ""],
            "國立臺灣美術館": ["博物館", ""],
            "國立臺灣歷史博物館": ["博物館", ""],
            "國立科學工藝博物館": ["博物館", ""],
            "高雄市立美術館": ["博物館", ""],
            "高雄市立歷史博物館": ["博物館", ""],
            "國立臺灣史前文化博物館": ["博物館", ""],
            "卑南遺址公園": ["博物館", ""],
            "莒光樓": ["博物館", ""],
            "國立故宮博物院南部院區": ["博物館", ""],
            "台北當代藝術館": ["博物館", ""],
            "朱銘美術館": ["博物館", ""],
            "奇美博物館": ["博物館", ""],
            "北投溫泉博物館": ["博物館", ""],
            "林本源園邸(林家花園) ": ["博物館", ""],
            "三峽歷史文物館": ["博物館", ""],
            "凱達格蘭文化館": ["博物館", ""],
            "國立臺灣博物館": ["博物館", ""],
            "臺南市美術館": ["博物館", ""],
            "台南山上花園水道博物館": ["博物館", ""],
            "北港朝天宮": ["宗教場所", ""],
            "南鯤鯓代天府": ["宗教場所", ""],
            "麻豆代天府": ["宗教場所", ""],
            "中臺禪寺": ["宗教場所", ""],
            "佛光山": ["宗教場所", ""],
            "萬和宮": ["宗教場所", ""],
            "大甲鎮瀾宮": ["宗教場所", ""],
            "清水祖師廟": ["宗教場所", ""],
            "法鼓山世界佛教教育園區": ["宗教場所", ""],
            "鹿港龍山寺": ["宗教場所", ""],
            "白沙屯拱天宮": ["宗教場所", ""],
            "車城福安宮": ["宗教場所", ""],
            "北港武德宮(北港武德宮管理委員會)": ["宗教場所", ""],
            "鹿港天后宮": ["宗教場所", ""],
            "嘉義城隍廟": ["宗教場所", ""],
            "遠雄海洋公園": ["其他", ""],
            "池上大坡池及周邊地區": ["其他", ""],
            "九族文化村": ["其他", ""],
            "國民革命忠烈祠": ["其他", ""],
            "國立臺灣藝術教育館": ["其他", ""],
            "臺北市立動物園": ["其他", ""],
            "士林官邸公園": ["其他", ""],
            "臺北自來水園區": ["其他", ""],
            "十分瀑布": ["其他", ""],
            "十分遊客中心": ["其他", ""],
            "淡水漁人碼頭": ["其他", ""],
            "猴硐煤礦博物園區": ["其他", ""],
            "水湳洞遊客中心": ["其他", ""],
            "蘇澳冷泉": ["其他", ""],
            "國立傳統藝術中心": ["其他", ""],
            "蘭陽博物園區": ["其他", ""],
            "慈湖": ["其他", ""],
            "大坑登山步道": ["其他", ""],
            "福壽山農場": ["其他", ""],
            "梧棲觀光漁港": ["其他", ""],
            "臺中都會公園": ["其他", ""],
            "草悟道": ["其他", ""],
            "東豐自行車綠廊及后豐鐵馬道(含后里馬場)": ["其他", ""],
            "國立自然科學博物館鳳凰谷鳥園生態園區": ["其他", ""],
            "清境農場": ["其他", ""],
            "武陵農場(含雪霸武陵遊客中心)": ["其他", ""],
            "行政院農業委員會特有生物研究保育中心": ["其他", ""],
            "竹山天梯風景區": ["其他", ""],
            "天空之橋": ["其他", ""],
            "烏樹林休閒園區": ["其他", ""],
            "壽山動物園": ["其他", ""],
            "蓮池潭": ["其他", ""],
            "高雄市文化中心": ["其他", ""],
            "旗津風景區": ["其他", ""],
            "水產試驗所東部海洋生物研究中心（水族生態研究館）": ["其他", ""],
            "慶修院": ["其他", ""],
            "花蓮縣石雕博物館": ["其他", ""],
            "澄清湖": ["其他", ""],
            "新竹漁港": ["其他", ""],
            "林口三井Outlet": ["其他", ""],
            "草嶺": ["其他", ""],
            "墾丁海水浴場": ["其他", ""],
            "關渡自然公園": ["其他", ""],
            "美麗華摩天輪": ["其他", ""],
            "台北101": ["其他", ""],
            "雲仙樂園": ["其他", ""],
            "大板根森林溫泉酒店": ["其他", ""],
            "小人國主題樂園": ["其他", ""],
            "埔心牧場": ["其他", ""],
            "桃園市客家文化館": ["其他", ""],
            "永安漁港": ["其他", ""],
            "新屋綠色走廊": ["其他", ""],
            "六福村主題遊樂園": ["其他", ""],
            "小叮噹科學主題樂園": ["其他", ""],
            "香格里拉樂園": ["其他", ""],
            "西湖渡假村": ["其他", ""],
            "杉林溪森林生態渡假園區": ["其他", ""],
            "泰雅渡假村": ["其他", ""],
            "桃米紙教堂": ["其他", ""],
            "劍湖山世界": ["其他", ""],
            "頑皮世界": ["其他", ""],
            "8大森林樂園": ["其他", ""],
            "大路觀主題樂園": ["其他", ""],
            "小墾丁渡假村": ["其他", ""],
            "清境高空觀景步道": ["其他", ""],
            "臺中公園": ["其他", ""],
            "臺北市孔廟": ["其他", ""],
            "淡水紅毛城": ["其他", ""],
            "滬尾礮臺": ["其他", ""],
            "前清淡水關稅務司官邸 (小白宮)": ["其他", ""],
            "北埔老街": ["其他", ""],
            "彰化孔子廟": ["其他", ""],
            "臺北市立兒童新樂園": ["其他", ""],
            "台北植物園": ["其他", ""],
            "基隆嶼": ["其他", ""],
            "華山1914文化創意產業園區": ["其他", ""],
            "松山文創園區": ["其他", ""],
            "鶯歌老街": ["其他", ""],
            "三峽老街": ["其他", ""],
            "八里左岸公園": ["其他", ""],
            "淡水金色水岸": ["其他", ""],
            "竹圍漁港": ["其他", ""],
            "大湖草莓文化館": ["其他", ""],
            "客家大院": ["其他", ""],
            "客家圓樓": ["其他", ""],
            "田尾公路花園": ["其他", ""],
            "溪州公園": ["其他", ""],
            "臺灣玻璃館": ["其他", ""],
            "扇形車庫及周邊地區": ["其他", ""],
            "內灣老街": ["其他", ""],
            "蘭嶼": ["其他", ""],
            "古坑綠色隧道": ["其他", ""],
            "駁二藝術特區": ["其他", ""],
            "愛河(五福四路至博愛一路)": ["其他", ""],
            "金針山休閒農業區": ["其他", ""],
            "澎湖生活博物館": ["其他", ""],
            "白石湖吊橋": ["其他", ""],
            "大溪老城區": ["其他", ""],
            "高美濕地": ["其他", ""],
            "霧峰林家園區": ["其他", ""],
            "臺中國家歌劇院": ["其他", ""],
            "一中商圈": ["其他", ""],
            "逢甲夜市": ["其他", ""],
            "潭雅神綠園道": ["其他", ""],
            "龍潭觀光大池": ["其他", ""],
            "勝利星村創意生活園區": ["其他", ""],
            "台電南部展示館": ["其他", ""],
            "林後四林平地森林園區": ["其他", ""],
            "屏東酒廠(內埔)": ["其他", ""],
            "山川琉璃吊橋": ["其他", ""],
            "草漯沙丘地質公園": ["其他", ""],
            "新竹公園": ["其他", ""],
            "綠川水岸廊道(含宮原眼科)": ["其他", ""],
            "南紡購物中心": ["其他", ""],
            "新化老街": ["其他", ""],
            "鹽水老街": ["其他", ""],
            "黃金海岸": ["其他", ""],
            "藍晒圖文創圈區": ["其他", ""],
            "潮好玩幸福村": ["其他", ""],
            "看海美術館旅服中心": ["其他", ""],
            "金獅湖風景區": ["其他", ""],
            "義大世界": ["其他", ""],
            "衛武營國家藝術文化中心": ["其他", ""],
            "旗山老街": ["其他", ""],
            "瑞豐商圈": ["其他", ""],
            "蚵仔寮漁港": ["其他", ""],
            "宏匯廣場": ["其他", ""],
            "老街溪沿岸步道": ["其他", ""],
            "八德埤塘自然生態公園": ["其他", ""],
            "1895乙未保台紀念公園": ["其他", ""],
            "鹿港老街及周邊地區": ["其他", ""],
            "王功漁港(含海空步道)": ["其他", ""],
            "文化路夜市": ["其他", ""],
            "檜意森活村": ["其他", ""],
            "東大門國際觀光夜市": ["其他", ""],
            "獅山砲陣地": ["其他", ""],
            "總兵署": ["其他", ""],
            "建功嶼": ["其他", ""],
            "臺中驛鐵道文化園區及綠空廊道": ["其他", ""],
            "帝國糖廠及LaLaport觀光廊帶": ["其他", ""],
            "內灣風景區": ["直轄市及縣(市)級風景特定區", ""],
            "初鹿牧場": ["休閒農業區及休閒農場", ""],
            "綠世界生態農場": ["休閒農業區及休閒農場", ""],
            "親不知子天空步道": ["觀光地區", ""],
            "臺北探索館": ["博物館", ""],
            "坪林茶業博物館": ["博物館", ""],
            "新北市黃金博物園區": ["博物館", ""],
            "美濃客家文物館": ["博物館", ""],
            "圓山別莊": ["博物館", ""],
            "林本源園邸( ": ["", ""],
            "台南美術館": ["", ""],
            "池上大坡池地區": ["", ""],
            "十分旅遊服務中心": ["", ""],
            "后里馬場": ["", ""],
            "東豐自行車綠廊及后豐鐵馬道": ["", ""],
            "武陵農場": ["", ""],
            "尖山埤江南渡假村": ["", ""],
            "打狗英國領事館文化園區": ["", ""],
            "世運主場館": ["", ""],
            "台北101景觀台": ["", ""],
            "大板根森林溫泉渡假村": ["", ""],
            "小叮噹科學遊樂區": ["", ""],
            "紙教堂見學園區": ["", ""],
            "滬尾砲臺": ["", ""],
            "前清淡水關稅務司官邸": ["", ""],
            "北埔遊憩區": ["", ""],
            "扇形車庫": ["", ""],
            "臺塑六輕阿媽公園": ["", ""],
            "紅毛港文化園區": ["", ""],
            "龍泉觀光啤酒廠": ["", ""],
        }


if __name__ == "__main__":
    tourism = Tourism(data_dir="data", checkpoint_path="checkpoint.txt")
    # xlsx_link_dict = tourism.get_xlsx_link_dict()
    # tourism.download_xlsx(xlsx_link_dict)
    # tourism.xlsx_to_csv()

    # history_link_dict = tourism.download_history_data()
    # tourism.history_data_to_csv()
    tourism.xlsx_to_csv()
