import requests
import os
import pandas as pd


class PopulationAndHousingCensus:
    def __init__(self, data_dir):
        self.data_dir = data_dir
        self.base_url = "https://ws.dgbas.gov.tw/001/Upload/463/relfile/11065"

        self.county = {
            "新北市": "230886",
            "臺北市": "230887",
            "桃園市": "230883",
            "基隆市": "230888",
            "新竹市": "230889",
            "宜蘭縣": "230890",
            "新竹縣": "230892",
            "臺中市": "230893",
            "苗栗縣": "230894",
            "彰化縣": "230895",
            "南投縣": "230896",
            "雲林縣": "230897",
            "臺南市": "230898",
            "高雄市": "230899",
            "嘉義市": "230900",
            "嘉義縣": "230901",
            "屏東縣": "230902",
            "澎湖縣": "230903",
            "臺東縣": "230904",
            "花蓮縣": "230905",
            "金門縣": "230906",
            "連江縣": "230907",
        }

        self.table = {
            "1_常住人口數及人口密度": "t001",
            "2_常住人口之性比例（不含移工）": "t002",
            "3_常住人口之年齡結構": "t003",
            "4_常住人口之年齡結構（不含移工）": "t004",
            "5_１５歲以上常住人口之婚姻狀況": "t005",
            "6_６歲以上本國籍常住人口使用語言情形": "t006",
            "7_６歲以上本國籍常住人口兒時最早學會語言情形": "t007",
            "8_６歲以上本國籍常住人口之父、母最常使用語言情形": "t008",
            "9_６至３４歲常住人口之在學情形": "t009",
            "10_１５歲以上常住人口之教育程度": "t010",
            "11_１５歲以上常住人口之最高學歷": "t011",
            "12_１５歲以上民間常住人口之工作狀況": "t012",
            "13_１５歲以上民間常住人口有工作者之職業": "t013",
            "14_１５歲以上民間常住人口有工作者之工作地與經常居住地概況": "t014",
            "15_１５歲以上跨鄉鎮市區通勤工作人口之年齡結構": "t015",
            "16_１５歲以上跨鄉鎮市區通勤工作人口之教育程度": "t016",
            "17_６歲以上在學人口之在學地與經常居住地概況": "t017",
            "18_６歲以上跨鄉鎮市區通學人口之年齡結構": "t018",
            "19_６歲以上跨鄉鎮市區通學人口之教育程度": "t019",
            "20_５歲以上常住人口遷徙情形": "t020",
            "21_學齡前兒童幼托及照顧概況": "t021",
            "22_常住人口長期照顧需求者概況": "t022",
            "23_６５歲以上常住人口長期照顧需求者概況": "t023",
            "24_１５歲以上常住人口與現有子女之居住概況": "t024",
            "25_６５歲以上常住人口與現有子女之居住概況": "t025",
            "26_６５歲以上常住人口之居住概況": "t026",
            "27_身心障礙常住人口之性別及年齡結構": "t027",
            "28_原住民族常住人口之性別及年齡結構": "t028",
            # "29_常住人口之國籍分布": "t029",
            # "30_外國籍與大陸港澳配偶常住人口數": "t030",
            "31_住戶數、常住人口數及平均每戶人口數": "t031",
            "32_普通住戶之戶內人口數": "t032",
            "33_普通住戶之家戶型態": "t033",
            "34_普通住戶之住宅所有權屬": "t034",
            "35_普通住戶住進現宅時間": "t035",
            "36_普通住戶在家上網情形": "t036",
            "37_住宅使用情形": "t037",
            "38_住宅之竣工年份": "t038",
            "39_住宅之樓地板面積": "t039",
            "40_住宅之建築類型": "t040",
            "41_空閒住宅之竣工年份": "t041",
            "42_空閒住宅之樓地板面積": "t042",
            "43_有人經常居住住宅之使用情形": "t043",
            "44_有人經常居住住宅之居住人數": "t044",
            "45_有人經常居住住宅之房廳數": "t045",
            "46_有人經常居住住宅之平均每人使用房廳數及衛浴套數": "t046",
        }

        self.column = {
            "1_常住人口數及人口密度": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "常住人口數(人)",
                "土地面積（平方公里）",
                "人口密度（人 / 平方公里）",
            ],
            "2_常住人口之性比例（不含移工）": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "常住人口數(人)",
                "性比例(女=100)",
            ],
            "3_常住人口之年齡結構": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "未滿１５歲",
                "１５－２４歲",
                "２５－３４歲",
                "３５－４４歲",
                "４５－５４歲",
                "５５－６４歲",
                "６５歲以上",
                "平均年齡（歲）",
            ],
            "4_常住人口之年齡結構（不含移工）": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "未滿１５歲",
                "１５－２４歲",
                "２５－３４歲",
                "３５－４４歲",
                "４５－５４歲",
                "５５－６４歲",
                "６５歲以上",
                "平均年齡（歲）",
            ],
            "5_１５歲以上常住人口之婚姻狀況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "未婚",
                "有配偶或同居伴侶",
                "離婚或分居",
                "喪偶",
            ],
            "6_６歲以上本國籍常住人口使用語言情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "６歲以上本國籍常住人口（人）",
                "每百位常住人口目前主要使用國語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用閩南語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用客語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用原住民族語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用其他語言之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用國語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用閩南語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用客語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用原住民族語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用其他語言之相對人數（人 / 百人） ",
                "每百位常住人口目前不知或無次要使用語言之相對人數（人 / 百人） ",
            ],
            "7_６歲以上本國籍常住人口兒時最早學會語言情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "６歲以上本國籍常住人口（人）",
                "每百位常住人口兒時最早學會國語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會閩南語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會客語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會原住民族語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會其他語言之相對人數（人 / 百人） ",
                "每百位常住人口兒時不知或無最早學會語言之相對人數（人 / 百人） ",
            ],
            "8_６歲以上本國籍常住人口之父、母最常使用語言情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "６歲以上本國籍常住人口（人）",
                "每百位父親最常使用國語之相對人數（人 / 百人） ",
                "每百位父親最常使用閩南語之相對人數（人 / 百人） ",
                "每百位父親最常使用客語之相對人數（人 / 百人） ",
                "每百位父親最常使用原住民族語之相對人數（人 / 百人） ",
                "每百位父親最常使用其他語言之相對人數（人 / 百人） ",
                "每百位母親最常使用國語之相對人數（人 / 百人） ",
                "每百位母親最常使用閩南語之相對人數（人 / 百人） ",
                "每百位母親最常使用客語之相對人數（人 / 百人） ",
                "每百位母親最常使用原住民族語之相對人數（人 / 百人） ",
                "每百位母親最常使用其他語言之相對人數（人 / 百人） ",
            ],
            "9_６至３４歲常住人口之在學情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "在學",
                "不在學",
                "在學率（％）",
            ],
            "10_１５歲以上常住人口之教育程度": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
            ],
            "11_１５歲以上常住人口之最高學歷": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
            ],
            "12_１５歲以上民間常住人口之工作狀況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "有工作合計",
                "農、林、漁、牧業",
                "工業小計",
                "製造業",
                "營建工程業",
                "服務業小計",
                "批發及零售業",
                "運輸及倉儲業",
                "住宿及餐飲業",
                "金融及保險業",
                "公共行政及國防；強制性社會安全",
                "教育業",
                "醫療保健及社會工作服務業",
                "其他服務業",
                "無工作",
            ],
            "13_１５歲以上民間常住人口有工作者之職業": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "民意代表、主管及經理人員",
                "專業人員",
                "技術員及助理專業人員",
                "事務支援人員",
                "服務及銷售工作人員",
                "農、林、漁、牧業生產人員",
                "技藝有關工作人員",
                "機械設備操作及組裝人員",
                "基層技術工及勞力工",
            ],
            "14_１５歲以上民間常住人口有工作者之工作地與經常居住地概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "同現住鄉鎮市區",
                "同現住縣市不同鄉鎮市區",
                "不同縣市或國外地區",
            ],
            "15_１５歲以上跨鄉鎮市區通勤工作人口之年齡結構": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "１５－２４歲",
                "２５－３４歲",
                "３５－４４歲",
                "４５歲以上",
            ],
            "16_１５歲以上跨鄉鎮市區通勤工作人口之教育程度": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
            ],
            "17_６歲以上在學人口之在學地與經常居住地概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "同現住鄉鎮市區",
                "同現住縣市不同鄉鎮市區",
                "不同縣市或國外地區",
            ],
            "18_６歲以上跨鄉鎮市區通學人口之年齡結構": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "６－１１歲",
                "１２－１４歲",
                "１５－１７歲",
                "１８－２４歲",
                "２５歲以上",
            ],
            "19_６歲以上跨鄉鎮市區通學人口之教育程度": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
            ],
            "20_５歲以上常住人口遷徙情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "同現住處所",
                "同現住鄉鎮市區不同處所",
                "同現住縣市不同鄉鎮市區",
                "不同縣市",
                "大陸地區（含港澳）及國外地區",
            ],
            "21_學齡前兒童幼托及照顧概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "已上幼兒園",
                "未上幼兒園合計",
                "未上幼兒園（托育）",
                "未上幼兒園（由家人照顧）",
            ],
            "22_常住人口長期照顧需求者概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "需長期照顧人數（人）",
                "每百位需長期照顧人口有吃飯障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有上下床障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有穿脫衣服障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有上廁所障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有洗澡障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有在室內外走動障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有備餐（煮飯）障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有洗（含晾曬）衣服障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有處理家務（打掃、擦桌等清潔工作）障礙之相對人次（人 / 百人） ",
            ],
            "23_６５歲以上常住人口長期照顧需求者概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "需長期照顧人數（人）",
                "每百位需長期照顧人口有吃飯障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有上下床障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有穿脫衣服障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有上廁所障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有洗澡障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有在室內外走動障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有備餐（煮飯）障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有洗（含晾曬）衣服障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有處理家務（打掃、擦桌等清潔工作）障礙之相對人次（人 / 百人） ",
            ],
            "24_１５歲以上常住人口與現有子女之居住概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "有子女者，與其居住距離最近的子女之居住地點（合計）",
                "有子女者，與其居住距離最近的子女之居住地點（同居住處所）",
                "有子女者，與其居住距離最近的子女之居住地點（同鄉鎮市區不同處所）",
                "有子女者，與其居住距離最近的子女之居住地點（同縣市不同鄉鎮市區）",
                "有子女者，與其居住距離最近的子女之居住地點（其他縣市）",
                "有子女者，與其居住距離最近的子女之居住地點（大陸地區（含港澳）及其他）",
                "無子女者",
            ],
            "25_６５歲以上常住人口與現有子女之居住概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "有子女者，與其居住距離最近的子女之居住地點（合計）",
                "有子女者，與其居住距離最近的子女之居住地點（同居住處所）",
                "有子女者，與其居住距離最近的子女之居住地點（同鄉鎮市區不同處所）",
                "有子女者，與其居住距離最近的子女之居住地點（同縣市不同鄉鎮市區）",
                "有子女者，與其居住距離最近的子女之居住地點（其他縣市）",
                "有子女者，與其居住距離最近的子女之居住地點（大陸地區（含港澳）及其他）",
                "無子女者",
            ],
            "26_６５歲以上常住人口之居住概況": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "僅與配偶或同居伴侶同住",
                "與子女同住",
                "與親友同住",
                "獨居",
                "其他",
            ],
            "27_身心障礙常住人口之性別及年齡結構": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                # "男",
                # "女",
                "未滿２５歲",
                "２５－４４歲",
                "４５－６４歲",
                "６５歲以上",
            ],
            "28_原住民族常住人口之性別及年齡結構": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                # "男",
                # "女",
                "未滿２５歲",
                "２５－４４歲",
                "４５－６４歲",
                "６５歲以上",
            ],
            "29_常住人口之國籍分布": [],
            "30_外國籍與大陸港澳配偶常住人口數": [],
            "31_住戶數、常住人口數及平均每戶人口數": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計-戶數（戶）",
                "總計-常住人口數（人）",
                "總計-平均每戶人口數（人 / 戶）",
                "普通住戶-戶數（戶）",
                "普通住戶-常住人口數（人）",
                "普通住戶-平均每戶人口數（人 / 戶）",
                "非普通住戶-戶數（戶）",
                "非普通住戶-常住人口數（人）",
                "非普通住戶-平均每戶人口數（人 / 戶）",
            ],
            "32_普通住戶之戶內人口數": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "１人",
                "２人",
                "３人",
                "４人",
                "５人",
                "６人以上",
                "平均每戶人口數（人 / 戶）",
            ],
            "33_普通住戶之家戶型態": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "核心家戶-合計",
                "核心家戶-夫婦、配偶或同居伴侶",
                "核心家戶-父母與未婚子女",
                "核心家戶-父（或母）與未婚子女（單親家庭）",
                "主幹家戶-合計",
                "主幹家戶-袓父母、父母及未婚子女",
                "主幹家戶-父母與已婚子女",
                "主幹家戶-袓父母與未婚孫子女（隔代家庭）",
                "單人家戶",
                "其他家戶-合計",
                "其他家戶-有親屬關係",
                "其他家戶-無親屬關係",
            ],
            "34_普通住戶之住宅所有權屬": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "自有",
                "不住在一起的配偶、父母或子女所擁有",
                "租用",
                "配住或其他（含借住）",
            ],
            "35_普通住戶住進現宅時間": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "７９年以前",
                "８０－８９年",
                "９０－９９年",
                "１００－１０４年",
                "１０５－１０８年",
                "１０９年",
            ],
            "36_普通住戶在家上網情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "家裡可以上網（戶）",
                "每百戶普通住戶有桌上型電腦之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有筆記型電腦之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有平板電腦之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有手機之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有智慧型家電之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有其他上網設備之相對戶數（戶 / 百戶）",
                "家裡無法上網（戶）",
            ],
            "37_住宅使用情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "有人經常居住住宅",
                "無人經常居住住宅-合計",
                "無人經常居住住宅-偶爾自住",
                "無人經常居住住宅-自住以外用途（如辦公室、倉庫等）",
                "無人經常居住住宅-目前沒有使用",
            ],
            "38_住宅之竣工年份": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "６９年以前",
                "７０－７９年",
                "８０－８９年",
                "９０－９９年",
                "１００－１０９年合計",
                "１００－１０４年",
                "１０５－１０９年",
            ],
            "39_住宅之樓地板面積": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "未滿６０平方公尺",
                "６０－未滿１２０平方公尺",
                "１２０－未滿１８０平方公尺",
                "１８０－未滿３００平方公尺",
                "３００平方公尺以上",
                "平均每宅面積（平方公尺 / 宅）",
            ],
            "40_住宅之建築類型": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "平房",
                "２－５樓",
                "６－１２樓",
                "１３樓以上",
            ],
            "41_空閒住宅之竣工年份": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "６９年以前",
                "７０－７９年",
                "８０－８９年",
                "９０－９９年",
                "１００－１０９年合計",
                "１００－１０４年",
                "１０５－１０９年",
            ],
            "42_空閒住宅之樓地板面積": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "未滿６０平方公尺",
                "６０－未滿１２０平方公尺",
                "１２０－未滿１８０平方公尺",
                "１８０－未滿３００平方公尺",
                "３００平方公尺以上",
                "平均每宅面積（平方公尺 / 宅）",
            ],
            "43_有人經常居住住宅之使用情形": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "住宅專用",
                "住宅兼其他用途-合計",
                "住宅兼其他用途-兼工業用",
                "住宅兼其他用途-兼商業或服務業用",
                "住宅兼其他用途-兼農業用",
            ],
            "44_有人經常居住住宅之居住人數": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "１人",
                "２人",
                "３人",
                "４人",
                "５人",
                "６人以上",
                "平均每宅居住人口數（人 / 宅）",
            ],
            "45_有人經常居住住宅之房廳數": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "１間",
                "２間",
                "３間",
                "４間",
                "５間",
                "６間以上",
                "平均每宅房廳數（間 / 宅）",
            ],
            "46_有人經常居住住宅之平均每人使用房廳數及衛浴套數": [
                "年月",
                "縣市",
                "鄉鎮市區",
                "總計",
                "每人使用房廳數-未滿１間",
                "每人使用房廳數-１－未滿２間",
                "每人使用房廳數-２－未滿３間",
                "每人使用房廳數-３間以上",
                "每人使用房廳數-平均每人使用房廳數（間 / 人）",
                "每人使用衛浴套數-未滿０. ５套",
                "每人使用衛浴套數-０. ５－未滿１套",
                "每人使用衛浴套數-１－未滿２套",
                "每人使用衛浴套數-２套以上",
                "每人使用衛浴套數-平均每人使用衛浴套數（套 / 人）",
            ],
        }

        self.number_of_district = {
            "新北市": 29,
            "臺北市": 12,
            "桃園市": 13,
            "基隆市": 7,
            "新竹市": 3,
            "宜蘭縣": 12,
            "新竹縣": 13,
            "臺中市": 29,
            "苗栗縣": 18,
            "彰化縣": 26,
            "南投縣": 13,
            "雲林縣": 20,
            "臺南市": 37,
            "高雄市": 38,
            "嘉義市": 2,
            "嘉義縣": 18,
            "屏東縣": 33,
            "澎湖縣": 6,
            "臺東縣": 16,
            "花蓮縣": 13,
            "金門縣": 6,
            "連江縣": 4,
        }

    def save_xlsx(self, table_name, county_name):
        url = (
            f"{self.base_url}/{self.county[county_name]}/{self.table[table_name]}.xlsx"
        )
        print("URL:", url)

        response = requests.get(url)

        if response.status_code == 200:
            dir_path = os.path.join(self.data_dir, table_name, "xlsx")
            os.makedirs(dir_path, exist_ok=True)
            xlsx_path = os.path.join(dir_path, f"{table_name}_{county_name}.xlsx")

            with open(xlsx_path, "wb") as f:
                f.write(response.content)
                print(f"Saved {xlsx_path}.")

        else:
            raise Exception(
                f"Failed to download file. Status code: {response.status_code}"
            )

    def xlsx_to_df(self, table_name, county_name):
        xlsx_name = f"{table_name}_{county_name}.xlsx"
        xlsx_path = os.path.join(self.data_dir, table_name, "xlsx", xlsx_name)

        if table_name == "1_常住人口數及人口密度":
            df = pd.read_excel(xlsx_path, skiprows=18)

            columns = [
                "col0",
                "鄉鎮市區",
                "常住人口數(人)",
                "常住人口數-男",
                "常住人口數-女",
                "土地面積（平方公里）",
                "人口密度（人 / 平方公里）",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=14)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["常住人口數(人)"])
            df = df.replace("　", "", regex=True)

        elif table_name == "2_常住人口之性比例（不含移工）":
            df = pd.read_excel(xlsx_path, skiprows=18)

            columns = [
                "col0",
                "鄉鎮市區",
                "常住人口數(人)",
                "常住人口數-男",
                "常住人口數-女",
                "性比例(女=100)",
                "年月",
                "縣市",
                "col8",
                "col9",
                "col10",
                "col11",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=14)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["常住人口數(人)"])
            df = df.replace("　", "", regex=True)

        elif table_name in ["3_常住人口之年齡結構", "4_常住人口之年齡結構（不含移工）"]:
            df = pd.read_excel(xlsx_path, skiprows=16)

            df.columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "未滿１５歲",
                "１５－２４歲",
                "２５－３４歲",
                "３５－４４歲",
                "col7",
                "４５－５４歲",
                "５５－６４歲",
                "６５歲以上",
                "平均年齡（歲）",
                "col12",
                "年月",
                "縣市",
                "col15",
                "col16",
                "col17",
            ]

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "5_１５歲以上常住人口之婚姻狀況":
            df = pd.read_excel(xlsx_path, skiprows=18)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "未婚",
                "有配偶或同居伴侶",
                "離婚或分居",
                "喪偶",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                for sheet_name in [1, 2]:
                    df2 = pd.read_excel(xlsx_path, sheet_name=sheet_name, skiprows=14)
                    df2.columns = columns
                    df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "6_６歲以上本國籍常住人口使用語言情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "６歲以上本國籍常住人口（人）",
                "每百位常住人口目前主要使用國語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用閩南語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用客語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用原住民族語之相對人數（人 / 百人） ",
                "每百位常住人口目前主要使用其他語言之相對人數（人 / 百人） ",
                "col8",
                "每百位常住人口目前次要使用國語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用閩南語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用客語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用原住民族語之相對人數（人 / 百人） ",
                "每百位常住人口目前次要使用其他語言之相對人數（人 / 百人） ",
                "每百位常住人口目前不知或無次要使用語言之相對人數（人 / 百人） ",
                "col15",
                "年月",
                "縣市",
                "col18",
                "col19",
                "col20",
                "col21",
            ]

            df.columns = columns
            df = df.dropna(subset=["６歲以上本國籍常住人口（人）"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "7_６歲以上本國籍常住人口兒時最早學會語言情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "６歲以上本國籍常住人口（人）",
                "每百位常住人口兒時最早學會國語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會閩南語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會客語之相對人數（人 / 百人） ",
                "col6",
                "每百位常住人口兒時最早學會原住民族語之相對人數（人 / 百人） ",
                "每百位常住人口兒時最早學會其他語言之相對人數（人 / 百人） ",
                "每百位常住人口兒時不知或無最早學會語言之相對人數（人 / 百人） ",
                "col10",
                "年月",
                "縣市",
                "col13",
                "col14",
                "col15",
                "col16",
            ]

            df.columns = columns
            df = df.dropna(subset=["６歲以上本國籍常住人口（人）"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "8_６歲以上本國籍常住人口之父、母最常使用語言情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "６歲以上本國籍常住人口（人）",
                "每百位父親最常使用國語之相對人數（人 / 百人） ",
                "每百位父親最常使用閩南語之相對人數（人 / 百人） ",
                "每百位父親最常使用客語之相對人數（人 / 百人） ",
                "每百位父親最常使用原住民族語之相對人數（人 / 百人） ",
                "每百位父親最常使用其他語言之相對人數（人 / 百人） ",
                "col8",
                "每百位母親最常使用國語之相對人數（人 / 百人） ",
                "每百位母親最常使用閩南語之相對人數（人 / 百人） ",
                "每百位母親最常使用客語之相對人數（人 / 百人） ",
                "每百位母親最常使用原住民族語之相對人數（人 / 百人） ",
                "每百位母親最常使用其他語言之相對人數（人 / 百人） ",
                "col14",
                "年月",
                "縣市",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
                "col22",
            ]

            df.columns = columns
            df = df.dropna(subset=["６歲以上本國籍常住人口（人）"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "9_６至３４歲常住人口之在學情形":
            df = pd.read_excel(xlsx_path, skiprows=18)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "在學",
                "不在學",
                "在學率（％）",
                "年月",
                "縣市",
                "col8",
                "col9",
                "col10",
                "col11",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                for sheet_name in [1, 2]:
                    df2 = pd.read_excel(xlsx_path, sheet_name=sheet_name, skiprows=14)
                    df2.columns = columns
                    df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name in [
            "10_１５歲以上常住人口之教育程度",
            "11_１５歲以上常住人口之最高學歷",
        ]:
            df = pd.read_excel(xlsx_path, skiprows=20)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=16)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "12_１５歲以上民間常住人口之工作狀況":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns_1 = [
                "col0",
                "鄉鎮市區",
                "總計",
                "有工作合計",
                "農、林、漁、牧業",
                "工業小計",
                "col6",
                "製造業",
                "營建工程業",
                "服務業小計",
                "批發及零售業",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
            ]

            df.columns = columns_1

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=16)

            columns_2 = [
                "col0",
                "鄉鎮市區",
                "運輸及倉儲業",
                "住宿及餐飲業",
                "金融及保險業",
                "公共行政及國防；強制性社會安全",
                "col6",
                "教育業",
                "醫療保健及社會工作服務業",
                "其他服務業",
                "無工作",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
            ]

            df2.columns = columns_2

            df2 = df2.dropna(subset=["運輸及倉儲業"])
            df2 = df2.replace("　", "", regex=True)

            df = pd.merge(df, df2, on="鄉鎮市區", how="inner")

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "13_１５歲以上民間常住人口有工作者之職業":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "民意代表、主管及經理人員",
                "專業人員",
                "技術員及助理專業人員",
                "事務支援人員",
                "col7",
                "服務及銷售工作人員",
                "農、林、漁、牧業生產人員",
                "技藝有關工作人員",
                "機械設備操作及組裝人員",
                "基層技術工及勞力工",
                "col13",
                "年月",
                "縣市",
                "col16",
                "col17",
                "col18",
                "col19",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "14_１５歲以上民間常住人口有工作者之工作地與經常居住地概況":
            df = pd.read_excel(xlsx_path, skiprows=19)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "同現住鄉鎮市區",
                "同現住縣市不同鄉鎮市區",
                "不同縣市或國外地區",
                "年月",
                "縣市",
                "col8",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=15)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "15_１５歲以上跨鄉鎮市區通勤工作人口之年齡結構":
            df = pd.read_excel(xlsx_path, skiprows=19)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "１５－２４歲",
                "２５－３４歲",
                "３５－４４歲",
                "４５歲以上",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
                "col13",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=15)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "16_１５歲以上跨鄉鎮市區通勤工作人口之教育程度":
            df = pd.read_excel(xlsx_path, skiprows=20)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=16)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "17_６歲以上在學人口之在學地與經常居住地概況":
            df = pd.read_excel(xlsx_path, skiprows=19)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "同現住鄉鎮市區",
                "同現住縣市不同鄉鎮市區",
                "不同縣市或國外地區",
                "年月",
                "縣市",
                "col8",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=15)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "18_６歲以上跨鄉鎮市區通學人口之年齡結構":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "６－１１歲",
                "１２－１４歲",
                "col5",
                "１５－１７歲",
                "１８－２４歲",
                "２５歲以上",
                "col9",
                "年月",
                "縣市",
                "col12",
                "col13",
                "col14",
                "col15",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "19_６歲以上跨鄉鎮市區通學人口之教育程度":
            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "國小及以下",
                "國（初）中",
                "高級中等",
                "大專及以上",
                "col7",
                "年月",
                "縣市",
                "col10",
                "col11",
                "col12",
            ]

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                df = pd.read_excel(xlsx_path, skiprows=17)
                columns.insert(5, "col13")

            else:
                df = pd.read_excel(xlsx_path, skiprows=20)

            df.columns = columns

            if county_name not in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                df2 = pd.read_excel(xlsx_path, sheet_name=1, skiprows=16)
                df2.columns = columns
                df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "20_５歲以上常住人口遷徙情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "同現住處所",
                "同現住鄉鎮市區不同處所",
                "col5",
                "同現住縣市不同鄉鎮市區",
                "不同縣市",
                "大陸地區（含港澳）及國外地區",
                "col9",
                "年月",
                "縣市",
                "col12",
                "col13",
                "col14",
                "col15",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "21_學齡前兒童幼托及照顧概況":
            df = pd.read_excel(xlsx_path, skiprows=18)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "已上幼兒園",
                "未上幼兒園合計",
                "未上幼兒園（托育）",
                "未上幼兒園（由家人照顧）",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
            ]

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                for sheet_name in [1, 2]:
                    df2 = pd.read_excel(xlsx_path, sheet_name=sheet_name, skiprows=14)
                    df2.columns = columns
                    df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name in [
            "22_常住人口長期照顧需求者概況",
            "23_６５歲以上常住人口長期照顧需求者概況",
        ]:
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "需長期照顧人數（人）",
                "每百位需長期照顧人口有吃飯障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有上下床障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有穿脫衣服障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有上廁所障礙之相對人次（人 / 百人） ",
                "col7",
                "每百位需長期照顧人口有洗澡障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有在室內外走動障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有備餐（煮飯）障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有洗（含晾曬）衣服障礙之相對人次（人 / 百人） ",
                "每百位需長期照顧人口有處理家務（打掃、擦桌等清潔工作）障礙之相對人次（人 / 百人） ",
                "col13",
                "年月",
                "縣市",
                "col16",
                "col17",
                "col18",
                "col19",
            ]

            df.columns = columns

            df = df.dropna(subset=["需長期照顧人數（人）"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name in [
            "24_１５歲以上常住人口與現有子女之居住概況",
            "25_６５歲以上常住人口與現有子女之居住概況",
        ]:
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "有子女者，與其居住距離最近的子女之居住地點（合計）",
                "有子女者，與其居住距離最近的子女之居住地點（同居住處所）",
                "有子女者，與其居住距離最近的子女之居住地點（同鄉鎮市區不同處所）",
                "col6",
                "有子女者，與其居住距離最近的子女之居住地點（同縣市不同鄉鎮市區）",
                "有子女者，與其居住距離最近的子女之居住地點（其他縣市）",
                "有子女者，與其居住距離最近的子女之居住地點（大陸地區（含港澳）及其他）",
                "無子女者",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "26_６５歲以上常住人口之居住概況":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "僅與配偶或同居伴侶同住",
                "與子女同住",
                "col5",
                "與親友同住",
                "獨居",
                "其他",
                "col9",
                "年月",
                "縣市",
                "col12",
                "col13",
                "col14",
                "col15",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name in [
            "27_身心障礙常住人口之性別及年齡結構",
            "28_原住民族常住人口之性別及年齡結構",
        ]:
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "男",
                "女",
                "col5",
                "未滿２５歲",
                "２５－４４歲",
                "４５－６４歲",
                "６５歲以上",
                "col10",
                "年月",
                "縣市",
                "col13",
                "col14",
                "col15",
                "col16",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "29_常住人口之國籍分布":
            return None

        elif table_name == "30_外國籍與大陸港澳配偶常住人口數":
            return None

        elif table_name == "31_住戶數、常住人口數及平均每戶人口數":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計-戶數（戶）",
                "總計-常住人口數（人）",
                "總計-平均每戶人口數（人 / 戶）",
                "普通住戶-戶數（戶）",
                "col6",
                "普通住戶-常住人口數（人）",
                "普通住戶-平均每戶人口數（人 / 戶）",
                "非普通住戶-戶數（戶）",
                "非普通住戶-常住人口數（人）",
                "非普通住戶-平均每戶人口數（人 / 戶）",
                "col12",
                "年月",
                "縣市",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
                "col22",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計-戶數（戶）"])
            df = df.replace("　", "", regex=True)

        elif table_name == "32_普通住戶之戶內人口數":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "１人",
                "２人",
                "３人",
                "col6",
                "４人",
                "５人",
                "６人以上",
                "平均每戶人口數（人 / 戶）",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "33_普通住戶之家戶型態":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "核心家戶-合計",
                "核心家戶-夫婦、配偶或同居伴侶",
                "核心家戶-父母與未婚子女",
                "核心家戶-父（或母）與未婚子女（單親家庭）",
                "主幹家戶-合計",
                "col8",
                "主幹家戶-袓父母、父母及未婚子女",
                "主幹家戶-父母與已婚子女",
                "主幹家戶-袓父母與未婚孫子女（隔代家庭）",
                "單人家戶",
                "其他家戶-合計",
                "其他家戶-有親屬關係",
                "其他家戶-無親屬關係",
                "col16",
                "年月",
                "縣市",
                "col19",
                "col20",
                "col21",
                "col22",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "34_普通住戶之住宅所有權屬":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "自有",
                "不住在一起的配偶、父母或子女所擁有",
                "col5",
                "租用",
                "配住或其他（含借住）",
                "col8",
                "年月",
                "縣市",
                "col11",
                "col12",
                "col13",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "35_普通住戶住進現宅時間":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "７９年以前",
                "８０－８９年",
                "９０－９９年",
                "col6",
                "１００－１０４年",
                "１０５－１０８年",
                "１０９年",
                "col10",
                "年月",
                "縣市",
                "col13",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "36_普通住戶在家上網情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "家裡可以上網（戶）",
                "每百戶普通住戶有桌上型電腦之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有筆記型電腦之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有平板電腦之相對戶數（戶 / 百戶）",
                "col7",
                "每百戶普通住戶有手機之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有智慧型家電之相對戶數（戶 / 百戶）",
                "每百戶普通住戶有其他上網設備之相對戶數（戶 / 百戶）",
                "家裡無法上網（戶）",
                "col12",
                "年月",
                "縣市",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "37_住宅使用情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "有人經常居住住宅",
                "無人經常居住住宅-合計",
                "col5",
                "無人經常居住住宅-偶爾自住",
                "無人經常居住住宅-自住以外用途（如辦公室、倉庫等）",
                "無人經常居住住宅-目前沒有使用",
                "col9",
                "年月",
                "縣市",
                "col12",
                "col13",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name in ["38_住宅之竣工年份", "41_空閒住宅之竣工年份"]:
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "６９年以前",
                "７０－７９年",
                "８０－８９年",
                "col6",
                "９０－９９年",
                "１００－１０９年合計",
                "１００－１０４年",
                "１０５－１０９年",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name in ["39_住宅之樓地板面積", "42_空閒住宅之樓地板面積"]:
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "未滿６０平方公尺",
                "６０－未滿１２０平方公尺",
                "col5",
                "１２０－未滿１８０平方公尺",
                "１８０－未滿３００平方公尺",
                "３００平方公尺以上",
                "平均每宅面積（平方公尺 / 宅）",
                "col10",
                "年月",
                "縣市",
                "col13",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "40_住宅之建築類型":
            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "平房",
                "２－５樓",
                "６－１２樓",
                "１３樓以上",
                "年月",
                "縣市",
                "col9",
                "col10",
                "col11",
                "col12",
                "col13",
                "col14",
                "col15",
            ]

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                df = pd.read_excel(xlsx_path, skiprows=16)
                columns.insert(5, "col16")

            else:
                df = pd.read_excel(xlsx_path, skiprows=18)

            df.columns = columns

            if county_name in ["新北市", "臺中市", "臺南市", "高雄市", "屏東縣"]:
                for sheet_name in [1, 2]:
                    df2 = pd.read_excel(xlsx_path, sheet_name=sheet_name, skiprows=14)
                    df2.columns = columns
                    df = pd.concat([df, df2])

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "43_有人經常居住住宅之使用情形":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "住宅專用",
                "住宅兼其他用途-合計",
                "col5",
                "住宅兼其他用途-兼工業用",
                "住宅兼其他用途-兼商業或服務業用",
                "住宅兼其他用途-兼農業用",
                "col9",
                "年月",
                "縣市",
                "col12",
                "col13",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
                "col22",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "44_有人經常居住住宅之居住人數":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "１人",
                "２人",
                "３人",
                "col6",
                "４人",
                "５人",
                "６人以上",
                "平均每宅居住人口數（人 / 宅）",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
                "col22",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

        elif table_name == "45_有人經常居住住宅之房廳數":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "１間",
                "２間",
                "３間",
                "col6",
                "４間",
                "５間",
                "６間以上",
                "平均每宅房廳數（間 / 宅）",
                "col11",
                "年月",
                "縣市",
                "col14",
                "col15",
                "col16",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
                "col22",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        elif table_name == "46_有人經常居住住宅之平均每人使用房廳數及衛浴套數":
            df = pd.read_excel(xlsx_path, skiprows=16)

            columns = [
                "col0",
                "鄉鎮市區",
                "總計",
                "每人使用房廳數-未滿１間",
                "每人使用房廳數-１－未滿２間",
                "每人使用房廳數-２－未滿３間",
                "每人使用房廳數-３間以上",
                "每人使用房廳數-平均每人使用房廳數（間 / 人）",
                "col8",
                "每人使用衛浴套數-未滿０. ５套",
                "每人使用衛浴套數-０. ５－未滿１套",
                "每人使用衛浴套數-１－未滿２套",
                "每人使用衛浴套數-２套以上",
                "每人使用衛浴套數-平均每人使用衛浴套數（套 / 人）",
                "col14",
                "年月",
                "縣市",
                "col17",
                "col18",
                "col19",
                "col20",
                "col21",
                "col22",
                "col23",
                "col24",
                "col25",
            ]

            df.columns = columns

            df = df.dropna(subset=["總計"])
            df = df.replace("　", "", regex=True)

            if county_name in [
                "基隆市",
                "新竹市",
                "嘉義市",
                "澎湖縣",
                "金門縣",
                "連江縣",
            ]:
                num = self.number_of_district[county_name]
                df = df[:num]

        else:
            raise

        # 填入年月與縣市
        df["年月"] = "109-11"
        df["縣市"] = county_name

        # 選擇需要的欄位
        df = df[self.column[table_name]]

        # 檢查行政區數目
        if len(df) != self.number_of_district[county_name]:
            raise ValueError(
                f"行政區數目錯誤：{county_name}({len(df)}/{self.number_of_district[county_name]})"
            )

        # 檢查空值
        if df.isnull().any().any():
            raise ValueError("DataFrame contains empty (NaN) values.")

        return df

    def df_to_csv(self, df, table_name, county_name):
        xlsx_dir = os.path.join(self.data_dir, table_name, "xlsx")
        xlsx_name = f"{table_name}_{county_name}.xlsx"
        xlsx_path = os.path.join(xlsx_dir, xlsx_name)

        csv_dir = os.path.join(self.data_dir, table_name)
        csv_name = f"{table_name}_{county_name}.csv"
        csv_path = os.path.join(csv_dir, csv_name)

        # 儲存csv
        df.to_csv(csv_path, index=False)
        print(f"Saved {csv_path}.")

        # # 壓縮xlsx
        # zip_path = xlsx_path.replace(".xlsx", ".zip")
        # os.system(f"zip {zip_path} {xlsx_path}")
        # print(f"Saved {zip_path}.")

        # 將xlsx移到converted資料夾
        converted_dir = os.path.join(self.data_dir, table_name, "xlsx", "converted")
        os.makedirs(converted_dir, exist_ok=True)
        os.system(f"mv {xlsx_path} {converted_dir}")
        print(f"Moved {xlsx_path} to {converted_dir}.")

    def save_all_data(self):
        for table_name in self.table:
            for county_name in self.county:
                self.save_xlsx(table_name, county_name)
                df = self.xlsx_to_df(table_name, county_name)
                self.df_to_csv(df, table_name, county_name)

    def save_merged_data(self):
        merged_tables = {
            # "1_2_3_4_常住人口": {
            #     "tables": [
            #         "1_常住人口數及人口密度",
            #         "3_常住人口之年齡結構",
            #         "2_常住人口之性比例（不含移工）",
            #         "4_常住人口之年齡結構（不含移工）",
            #     ],
            #     "columns": {
            #         "年月": "年月",
            #         "縣市": "縣市",
            #         "鄉鎮市區": "鄉鎮市區",
            #         "常住人口數(人)_x": "常住人口數(人)",
            #         "土地面積（平方公里）": "土地面積（平方公里）",
            #         "人口密度（人 / 平方公里）": "人口密度（人 / 平方公里）",
            #         # "總計_x" = "常住人口數(人)_x",
            #         "未滿１５歲_x": "未滿１５歲人口",
            #         "１５－２４歲_x": "１５－２４歲人口數",
            #         "２５－３４歲_x": "２５－３４歲人口數",
            #         "３５－４４歲_x": "３５－４４歲人口數",
            #         "４５－５４歲_x": "４５－５４歲人口數",
            #         "５５－６４歲_x": "５５－６４歲人口數",
            #         "６５歲以上_x": "６５歲以上人口數",
            #         "平均年齡（歲）_x": "平均年齡（歲）",
            #         "常住人口數(人)_y": "不含移工常住人口數(人)",
            #         "性比例(女=100)": "不含移工性比例(女=100)",
            #         # "總計_y" = "常住人口數(人)_y",
            #         "未滿１５歲_y": "不含移工未滿１５歲人口",
            #         "１５－２４歲_y": "不含移工１５－２４歲人口數",
            #         "２５－３４歲_y": "不含移工２５－３４歲人口數",
            #         "３５－４４歲_y": "不含移工３５－４４歲人口數",
            #         "４５－５４歲_y": "不含移工４５－５４歲人口數",
            #         "５５－６４歲_y": "不含移工５５－６４歲人口數",
            #         "６５歲以上_y": "不含移工６５歲以上人口數",
            #         "平均年齡（歲）_y": "不含移工平均年齡（歲）",
            #     }
            # },
            "37_38_39_40_41_42_43_44_45_46_各鄉鎮市區住宅普查": {
                "tables": [
                    "37_住宅使用情形",
                    "38_住宅之竣工年份",
                    "39_住宅之樓地板面積",
                    "40_住宅之建築類型",
                    "41_空閒住宅之竣工年份",
                    "42_空閒住宅之樓地板面積",
                    "43_有人經常居住住宅之使用情形",
                    "44_有人經常居住住宅之居住人數",
                    "45_有人經常居住住宅之房廳數",
                    "46_有人經常居住住宅之平均每人使用房廳數及衛浴套數",
                ],
                "columns": {
                    "年月": "年月",
                    "縣市": "縣市",
                    "鄉鎮市區": "鄉鎮市區",
                    "37_總計": "住宅總數",
                    "37_有人經常居住住宅": "有人經常居住住宅數",
                    "37_無人經常居住住宅-合計": "無人經常居住住宅數-合計",
                    "37_無人經常居住住宅-偶爾自住": "無人經常居住住宅數-偶爾自住",
                    "37_無人經常居住住宅-自住以外用途（如辦公室、倉庫等）": "無人經常居住住宅數-自住以外用途（如辦公室、倉庫等）",
                    "37_無人經常居住住宅-目前沒有使用": "無人經常居住住宅數-目前沒有使用",
                    # "38_總計" = "37_總計",
                    "38_６９年以前": "６９年以前竣工之住宅數",
                    "38_７０－７９年": "７０－７９年竣工之住宅數",
                    "38_８０－８９年": "８０－８９年竣工之住宅數",
                    "38_９０－９９年": "９０－９９年竣工之住宅數",
                    "38_１００－１０９年合計": "１００－１０９年竣工之住宅數",
                    "38_１００－１０４年": "１００－１０４年竣工之住宅數",
                    "38_１０５－１０９年": "１０５－１０９年竣工之住宅數",
                    # "39_總計" = "37_總計",
                    "39_未滿６０平方公尺": "樓地板面積未滿６０平方公尺之住宅數",
                    "39_６０－未滿１２０平方公尺": "樓地板面積６０－未滿１２０平方公尺之住宅數",
                    "39_１２０－未滿１８０平方公尺": "樓地板面積１２０－未滿１８０平方公尺之住宅數",
                    "39_１８０－未滿３００平方公尺": "樓地板面積１８０－未滿３００平方公尺之住宅數",
                    "39_３００平方公尺以上": "樓地板面積３００平方公尺以上之住宅數",
                    "39_平均每宅面積（平方公尺 / 宅）": "平均每宅樓地板面積（平方公尺 / 宅）",
                    # "40_總計" = "37_總計",
                    "40_平房": "平房數",
                    "40_２－５樓": "總樓層２－５樓之住宅數",
                    "40_６－１２樓": "總樓層６－１２樓之住宅數",
                    "40_１３樓以上": "總樓層１３樓以上之住宅數",
                    "41_總計": "空閒住宅總數",
                    "41_６９年以前": "６９年以前竣工之空閒住宅數",
                    "41_７０－７９年": "７０－７９年竣工之空閒住宅數",
                    "41_８０－８９年": "８０－８９年竣工之空閒住宅數",
                    "41_９０－９９年": "９０－９９年竣工之空閒住宅數",
                    "41_１００－１０９年合計": "１００－１０９年竣工之空閒住宅數",
                    "41_１００－１０４年": "１００－１０４年竣工之空閒住宅數",
                    "41_１０５－１０９年": "１０５－１０９年竣工之空閒住宅數",
                    # "42_總計" = "41_總計",
                    "42_未滿６０平方公尺": "樓地板面積未滿６０平方公尺之空閒住宅數",
                    "42_６０－未滿１２０平方公尺": "樓地板面積６０－未滿１２０平方公尺之空閒住宅數",
                    "42_１２０－未滿１８０平方公尺": "樓地板面積１２０－未滿１８０平方公尺之空閒住宅數",
                    "42_１８０－未滿３００平方公尺": "樓地板面積１８０－未滿３００平方公尺之空閒住宅數",
                    "42_３００平方公尺以上": "樓地板面積３００平方公尺以上之空閒住宅數",
                    "42_平均每宅面積（平方公尺 / 宅）": "平均每宅樓地板面積（平方公尺 / 宅）",
                    # "43_總計" = "37_有人經常居住住宅",
                    "43_住宅專用": "有人經常居住住宅用於住宅專用數",
                    "43_住宅兼其他用途-合計": "有人經常居住住宅用於住宅兼其他用途數-合計",
                    "43_住宅兼其他用途-兼工業用": "有人經常居住住宅兼工業用數",
                    "43_住宅兼其他用途-兼商業或服務業用": "有人經常居住住宅兼商業或服務業用數",
                    "43_住宅兼其他用途-兼農業用": "有人經常居住住宅兼農業用數",
                    # "44_總計" = "43_總計",
                    "44_１人": "有１人經常居住住宅數",
                    "44_２人": "有２人經常居住住宅數",
                    "44_３人": "有３人經常居住住宅數",
                    "44_４人": "有４人經常居住住宅數",
                    "44_５人": "有５人經常居住住宅數",
                    "44_６人以上": "有６人經常居住住宅數",
                    "44_平均每宅居住人口數（人 / 宅）": "平均每宅居住人口數（人 / 宅）",
                    # "45_總計" = "43_總計",
                    "45_１間": "有人經常居住住宅之房廳數１間",
                    "45_２間": "有人經常居住住宅之房廳數２間",
                    "45_３間": "有人經常居住住宅之房廳數３間",
                    "45_４間": "有人經常居住住宅之房廳數４間",
                    "45_５間": "有人經常居住住宅之房廳數５間",
                    "45_６間以上": "有人經常居住住宅之房廳數６間以上",
                    "45_平均每宅房廳數（間 / 宅）": "有人經常居住住宅平均每宅房廳數（間 / 宅）",
                    # "46_總計" = "43_總計",
                    "46_每人使用房廳數-未滿１間": "每人使用房廳數-未滿１間",
                    "46_每人使用房廳數-１－未滿２間": "每人使用房廳數-１－未滿２間",
                    "46_每人使用房廳數-２－未滿３間": "每人使用房廳數-２－未滿３間",
                    "46_每人使用房廳數-３間以上": "每人使用房廳數-３間以上",
                    "46_每人使用房廳數-平均每人使用房廳數（間 / 人）": "平均每人使用房廳數（間 / 人）",
                    "46_每人使用衛浴套數-未滿０. ５套": "每人使用衛浴套數-未滿０. ５套",
                    "46_每人使用衛浴套數-０. ５－未滿１套": "每人使用衛浴套數-０. ５－未滿１套",
                    "46_每人使用衛浴套數-１－未滿２套": "每人使用衛浴套數-１－未滿２套",
                    "46_每人使用衛浴套數-２套以上": "每人使用衛浴套數-２套以上",
                    "46_每人使用衛浴套數-平均每人使用衛浴套數（套 / 人）": "平均每人使用衛浴套數（套 / 人）",
                },
            }
        }

        for merged_table_name in merged_tables:
            df_merged = pd.DataFrame()

            for table_name in merged_tables[merged_table_name]["tables"]:
                df_table = pd.DataFrame()

                for county_name in self.county:
                    # self.save_xlsx(table_name, county_name)
                    df_county = self.xlsx_to_df(table_name, county_name)

                    # 避免欄位名稱重複
                    df_county.columns = [
                        (
                            f"{table_name.split('_')[0]}_{col}"
                            if col not in ["年月", "縣市", "鄉鎮市區"]
                            else col
                        )
                        for col in df_county.columns
                    ]

                    # 合併不同縣市資料
                    df_table = pd.concat([df_table, df_county], ignore_index=True)

                if df_merged.empty:
                    df_merged = df_table

                else:
                    df_merged = pd.merge(
                        df_merged,
                        df_table,
                        on=["年月", "縣市", "鄉鎮市區"],
                        how="inner",
                    )

            # 刪除重複欄位，改欄位名稱
            df_merged = df_merged[merged_tables[merged_table_name]["columns"].keys()]
            df_merged = df_merged.rename(
                columns=merged_tables[merged_table_name]["columns"]
            )

            # 存檔
            csv_path = os.path.join(self.data_dir, f"{merged_table_name}.csv")
            df_merged.to_csv(csv_path, index=False)
            print(f"Saved {csv_path}.")


if __name__ == "__main__":
    population_and_housing_census = PopulationAndHousingCensus(data_dir="data")
    # population_and_housing_census.save_all_data()
    population_and_housing_census.save_merged_data()
